{"blogs":[{"title":"Nodejs","content":"blogsArray","id":1685971464299,"author":"sahil"},{"title":"Angular","content":"TypeError: Cannot read property &#39;path&#39; of undefined – \nchovy\n Sep 21, 2012 at 8:24\nreq.route.path is correct and documented here. Which version of express are you using? – \nzemirco\n Sep 21, 2012 at 17:31 \nI&#39;m having the same issue. req.route is undefined. Im using express 3.4.4. What can ","id":1686026839855,"author":"Sahil Mistry"},{"title":"Angular","content":"The filter() method is an iterative method. It calls a provided callbackFn function once for each element in an array, and constructs a new array of all the values for which callbackFn returns a truthy value. Array elements which do not pass the callbackFn test are not included in the new array.\r\n\r\ncallbackFn is invoked only for array indexes which have assigned values. It is not invoked for empty slots in sparse arrays.\r\n\r\nThe filter() method is a copying method. It does not alter this but instead returns a shallow copy that contains the same elements as the ones from the original array (with some filtered out). However, the function provided as callbackFn can mutate the array. Note, however, that the length of the array is saved before the first invocation of callbackFn. Therefore:","id":1686030239337,"author":"Bhagvanji Nakum"},{"title":"Nest Js","content":"/ Notice there are three words below length 6, but since they've been modified one is returned\r\n// [\"spray\"]\r\n\r\n// Appending new words\r\nwords = [\"spray\", \"limit\", \"exuberant\", \"destruction\", \"elite\", \"present\"];\r\nconst appendedWords = words.filter((word, index, arr) => {\r\n  arr.push(\"new\");\r\n  return word.length < 6;\r\n});\r\n\r\nconsole.log(appendedWords);\r\n// Only three fits the condition even though the `words` itself now has a lot more words with character length less than 6\r\n// [\"spray\" ,\"limit\" ,\"elite\"]\r\n\r\n// Deleting words\r\nwords = [\"spray\", \"limit","id":1686030354934,"author":"Jay Mehta"}]}